[
  "obsidian-excalidraw-plugin",
  "obsidian-admonition",
  "obsidian-day-planner",
  "obsidian-activity-history",
  "obsidian-version-history-diff",
  "code-block-copy",
  "highlightr-plugin",
  "omnisearch",
  "obsidian-audio-player",
  "obsidian-icons-plugin",
  "x86-flow-graphing",
  "obsidian-git",
  "make-md",
  "lovely-mindmap",
  "terminal"
]