[
  "obsidian-excalidraw-plugin",
  "obsidian-admonition",
  "obsidian-day-planner",
  "obsidian-activity-history",
  "obsidian-version-history-diff",
  "code-block-copy",
  "obsidian-chartsview-plugin",
  "highlightr-plugin",
  "omnisearch",
  "obsidian-audio-player",
  "obsidian-icons-plugin",
  "dataview",
  "x86-flow-graphing",
  "obsidian-git"
]